Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-info",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:460722568061:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::460722568061:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*",
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dataportal-locks-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-mutex-locks",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Anscestors",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Descendants",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-Ontologies",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-vcfs",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004",
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::460722568061:role/sbeacon_backend_ec2_deidentification_instance_role",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-generateReports will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-generateReports" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/clinical-workflows/*/reports/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-performQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:performQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "BeaconApi" {
        id                           = "auudf51p4c"
        name                         = "sbeacon-backend-api"
      ~ tags                         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
        id                    = "ags-auudf51p4c-prod"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be updated in-place
  ~ resource "aws_athena_workgroup" "sbeacon-workgroup" {
        id            = "query_workgroup"
        name          = "query_workgroup"
      ~ tags          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:460722568061:stack/sbeacon-terms-index-stack/e623d450-309a-11f0-abc7-0e5e89e23755"
        name               = "sbeacon-terms-index-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:460722568061:stack/sbeacon-terms-stack/e626ba80-309a-11f0-9632-0eac7beab155"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api_distribution" {
        id                              = "E1ACA5WT51ELER"
      ~ tags                            = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "anscestor_terms" {
        id                          = "sbeacon-Anscestors"
        name                        = "sbeacon-Anscestors"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be updated in-place
  ~ resource "aws_dynamodb_table" "clinic_jobs" {
        id                          = "sbeacon-dataportal-clinic-jobs"
        name                        = "sbeacon-dataportal-clinic-jobs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_annotations" {
        id                          = "sbeacon-dataportal-clinical-annotations"
        name                        = "sbeacon-dataportal-clinical-annotations"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_variants" {
        id                          = "sbeacon-dataportal-clinical-variants"
        name                        = "sbeacon-dataportal-clinical-variants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_locks_table" {
        id                          = "sbeacon-dataportal-mutex-locks"
        name                        = "sbeacon-dataportal-mutex-locks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_pricing_cache" {
        id                          = "sbeacon-dataportal-pricing-cache"
        name                        = "sbeacon-dataportal-pricing-cache"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "descendant_terms" {
        id                          = "sbeacon-Descendants"
        name                        = "sbeacon-Descendants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be updated in-place
  ~ resource "aws_dynamodb_table" "juptyer_notebooks" {
        id                          = "sbeacon-dataportal-juptyer-notebooks"
        name                        = "sbeacon-dataportal-juptyer-notebooks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be updated in-place
  ~ resource "aws_dynamodb_table" "ontologies" {
        id                          = "sbeacon-Ontologies"
        name                        = "sbeacon-Ontologies"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be updated in-place
  ~ resource "aws_dynamodb_table" "projects" {
        id                          = "sbeacon-dataportal-projects"
        name                        = "sbeacon-dataportal-projects"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be updated in-place
  ~ resource "aws_dynamodb_table" "saved_queries" {
        id                          = "sbeacon-dataportal-saved-queries"
        name                        = "sbeacon-dataportal-saved-queries"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be updated in-place
  ~ resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
        id                          = "sbeacon-dataportal-users-info"
        name                        = "sbeacon-dataportal-users-info"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be updated in-place
  ~ resource "aws_dynamodb_table" "vcfs" {
        id                          = "sbeacon-vcfs"
        name                        = "sbeacon-vcfs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be updated in-place
  ~ resource "aws_glue_catalog_database" "metadata-database" {
        id           = "460722568061:sbeacon_metadata"
        name         = "sbeacon_metadata"
      ~ tags         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be updated in-place
  ~ resource "aws_glue_crawler" "sbeacon-crawler" {
        id                     = "sbeacon-crawler"
        name                   = "sbeacon-crawler"
      ~ tags                   = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all               = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
        id          = "sbeacon_backend_ec2_deidentification_instance_profile"
        name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      ~ tags        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::460722568061:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
                          - "arn:aws:s3:::gasi-metadata-20250513021731641000000004",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be updated in-place
  ~ resource "aws_iam_role" "ec2_deidentification_instance_role" {
        id                    = "sbeacon_backend_ec2_deidentification_instance_role"
        name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_iam_role.glue_role will be updated in-place
  ~ resource "aws_iam_role" "glue_role" {
        id                    = "glue_role"
        name                  = "glue_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be updated in-place
  ~ resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
        id                    = "sbeacon_backend_sagemaker_jupyter_instance_role"
        name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ code_sha256                 = "2x4qPukOb5/7MGA1blC3QRlCcXzt0TK/wBRzK+ZGY6U=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-15T02:34:07.798+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "6XFaSGxtK4vpRYZIsXLJz3QhaLc/nRRyXUKNVFJC5ley9arfMv9ZTetcnRG87L2ejKNCc3pQzz5ixzkUVPb1fA==" -> "k1Jnw+dc3n30iVkfZznhVmxazHxQ5+9+NMzBYA1wzPGkqh0E+75QXUNlCClFp/YdiojC/7qs55E5W+7yuIuMew==" # forces replacement
      ~ source_code_size            = 18422409 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "dataportal-bucket" {
        id                          = "gasi-dataportal-20250513021720562800000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "gasi-lambda-layers-20250513021721893000000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "metadata-bucket" {
        id                          = "gasi-metadata-20250513021731641000000004"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "variants-bucket" {
        id                          = "gasi-variants-20250513021717848900000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ tags      = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all  = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.performQuery will be updated in-place
  ~ resource "aws_sns_topic" "performQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:460722568061:performQuery"
        name                                     = "performQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be updated in-place
  ~ resource "aws_sns_topic" "splitQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:460722568061:splitQuery"
        name                                     = "splitQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be updated in-place
  ~ resource "aws_wafv2_web_acl" "security-all-cloudfront" {
        id                          = "24da2738-a45e-425d-83db-65aabe555d47"
        name                        = "security-all-cloudfront"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/svep-references",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-batchStarter will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-batchStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:ap-southeast-3:460722568061:svep-backend-batchSubmitQueue",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-initQuery",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetAccountSettings",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricStatistics",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-batchSubmit will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-batchSubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + "arn:aws:sqs:ap-southeast-3:460722568061:svep-backend-batchSubmitQueue",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-clearTempAndRegions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-clearTempAndRegions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeStream",
              + "dynamodb:GetRecords",
              + "dynamodb:GetShardIterator",
              + "dynamodb:ListStreams",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/stream/2025-08-15T04:02:39.142",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-clearTempAndRegions",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concat will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-concat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-createPages",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatPages will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-concatPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatStarter will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-concatStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concat",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatStarter",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-createPages will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-createPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-createPages",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/clinical-workflows/*",
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-deleteClinicalWorkflow will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-deleteClinicalWorkflow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
       
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.